Revit 2026 API

# FabricAreaCreate(Document, Element, IListCurveLoop, XYZ, XYZ, ElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FabricArea Create(
	Document aDoc,
	Element hostElement,
	IList<CurveLoop> curveLoops,
	XYZ majorDirection,
	XYZ majorDirectionOrigin,
	ElementId fabricAreaTypeId,
	ElementId fabricSheetTypeId
)
```
```vb
Public Shared Function Create (
	aDoc As Document,
	hostElement As Element,
	curveLoops As IList(Of CurveLoop),
	majorDirection As XYZ,
	majorDirectionOrigin As XYZ,
	fabricAreaTypeId As ElementId,
	fabricSheetTypeId As ElementId
) As FabricArea
```
```cpp
public:
static FabricArea^ Create(
	Document^ aDoc,
	Element^ hostElement,
	IList<CurveLoop^>^ curveLoops,
	XYZ^ majorDirection,
	XYZ^ majorDirectionOrigin,
	ElementId^ fabricAreaTypeId,
	ElementId^ fabricSheetTypeId
)
```
```fsharp
static member Create :
        aDoc : Document *
        hostElement : Element *
        curveLoops : IList<CurveLoop> *
        majorDirection : XYZ *
        majorDirectionOrigin : XYZ *
        fabricAreaTypeId : ElementId *
        fabricSheetTypeId : ElementId -> FabricArea
```

#### Parameters

aDoc Document

hostElement Element

curveLoops IListCurveLoop

majorDirection XYZ

majorDirectionOrigin XYZ

fabricAreaTypeId ElementId

fabricSheetTypeId ElementId

#### Return Value

FabricArea

#### Reference

FabricArea Class

Create Overload

Autodesk.Revit.DB.Structure Namespace